xfire-xmlbeans/src/test/org/codehaus/xfire/xmlbeans/test.xml

<?xml version="1.0"?>
<s12:Envelope
  xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
  xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"
  xmlns:ew="http://www.example.com/warnings">
  <s12:Header>

  </s12:Header>
  <s12:Body>
    <wse:Subscribe>
      <wse:Delivery>
        <wse:NotifyTo>
          <wsa:Address>
              http://www.example.com/MyEventSink/OnStormWarning
          </wsa:Address>
          <wsa:ReferenceProperties>
            <ew:MySubscription>2597</ew:MySubscription>
          </wsa:ReferenceProperties>
        </wse:NotifyTo>
      </wse:Delivery>
    </wse:Subscribe>
	<ew:test>
		test
	</ew:test>
	<ew:test>
		test
	</ew:test>
  </s12:Body>
</s12:Envelope>